samples/expression_bdd_dot/deep_all_ops.dot
digraph bdd {
  rankdir=TB;
  "alpha" [label = "alpha", style = "filled", shape = "circle", name = "alpha"];
  "beta" [label = "beta", style = "filled", shape = "circle", name = "beta"];
  "beta" [label = "beta", style = "filled", shape = "circle", name = "beta"];
  "delta" [label = "delta", style = "filled", shape = "circle", name = "delta"];
  "delta" [label = "delta", style = "filled", shape = "circle", name = "delta"];
  "eta" [label = "eta", style = "filled", shape = "circle", name = "eta"];
  "gamma" [label = "gamma", style = "filled", shape = "circle", name = "gamma"];
  "gamma" [label = "gamma", style = "filled", shape = "circle", name = "gamma"];
  "iota" [label = "iota", style = "filled", shape = "circle", name = "iota"];
  "iota" [label = "iota", style = "filled", shape = "circle", name = "iota"];
  "kappa" [label = "kappa", style = "filled", shape = "circle", name = "kappa"];
  "kappa" [label = "kappa", style = "filled", shape = "circle", name = "kappa"];
  "node15" [label = "0", style = "filled", shape = "box", name = "node15", fillcolor = "lightgray"];
  "node16" [label = "1", style = "filled", shape = "box", name = "node16", fillcolor = "lightgray"];
  "theta" [label = "theta", style = "filled", shape = "circle", name = "theta"];
  "zeta" [label = "zeta", style = "filled", shape = "circle", name = "zeta"];
  "alpha" -> "beta" [style = "dashed"];
  "alpha" -> "beta" [style = "solid"];
  "beta" -> "gamma" [style = "solid"];
  "beta" -> "gamma" [style = "solid"];
  "beta" -> "iota" [style = "dashed"];
  "beta" -> "zeta" [style = "dashed"];
  "delta" -> "iota" [style = "dashed"];
  "delta" -> "iota" [style = "solid"];
  "delta" -> "zeta" [style = "solid"];
  "delta" -> "zeta" [style = "dashed"];
  "eta" -> "iota" [style = "dashed"];
  "eta" -> "theta" [style = "solid"];
  "gamma" -> "delta" [style = "dashed"];
  "gamma" -> "delta" [style = "dashed"];
  "gamma" -> "iota" [style = "solid"];
  "gamma" -> "zeta" [style = "solid"];
  "iota" -> "kappa" [style = "solid"];
  "iota" -> "kappa" [style = "solid"];
  "iota" -> "node15" [style = "dashed"];
  "iota" -> "node16" [style = "dashed"];
  "kappa" -> "node15" [style = "solid"];
  "kappa" -> "node15" [style = "dashed"];
  "kappa" -> "node16" [style = "dashed"];
  "kappa" -> "node16" [style = "solid"];
  "theta" -> "iota" [style = "dashed"];
  "theta" -> "iota" [style = "solid"];
  "zeta" -> "eta" [style = "dashed"];
  "zeta" -> "iota" [style = "solid"];
}
